OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1455.h
#define URSTIF                  UIRbits.URSTIF                  // bit 0
#define UERRIF                  UIRbits.UERRIF                  // bit 1
#define ACTVIF                  UIRbits.ACTVIF                  // bit 2
#define TRNIF                   UIRbits.TRNIF                   // bit 3
#define IDLEIF                  UIRbits.IDLEIF                  // bit 4
#define STALLIF                 UIRbits.STALLIF                 // bit 5
#define SOFIF                   UIRbits.SOFIF                   // bit 6

#define PPBI                    USTATbits.PPBI                  // bit 1
#define DIR                     USTATbits.DIR                   // bit 2
#define ENDP0                   USTATbits.ENDP0                 // bit 3
#define ENDP1                   USTATbits.ENDP1                 // bit 4
#define ENDP2                   USTATbits.ENDP2                 // bit 5
#define ENDP3                   USTATbits.ENDP3                 // bit 6

#define SWDTEN                  WDTCONbits.SWDTEN               // bit 0
#define WDTPS0                  WDTCONbits.WDTPS0               // bit 1
#define WDTPS1                  WDTCONbits.WDTPS1               // bit 2
#define WDTPS2                  WDTCONbits.WDTPS2               // bit 3
#define WDTPS3                  WDTCONbits.WDTPS3               // bit 4
#define WDTPS4                  WDTCONbits.WDTPS4               // bit 5

#define WPUA3                   WPUAbits.WPUA3                  // bit 3
#define WPUA4                   WPUAbits.WPUA4                  // bit 4
#define WPUA5                   WPUAbits.WPUA5                  // bit 5

#endif // #ifndef NO_BIT_DEFINES

#endif // #ifndef __PIC16LF1455_H__
